CircularFishSwimming/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          768;
        startFace       1571072;
    }
    outlet
    {
        type            patch;
        nFaces          768;
        startFace       1571840;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1024;
        startFace       1572608;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1024;
        startFace       1573632;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          786432;
        startFace       1574656;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          786432;
        startFace       2361088;
    }
)

// ************************************************************************* //
