CircularFishSwimming/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

nx 1024;
ny 768;
nz 1;

lx -0.6;
ly -0.45;
lz -0.01;
rx 0.6;
ry 0.45;
rz 0.01;

vertices
(
    ($lx $ly $lz)
    ($rx $ly $lz)
    ($rx $ry $lz)
    ($lx $ry $lz)
    ($lx $ly $rz)
    ($rx $ly $rz)
    ($rx $ry $rz)
    ($lx $ry $rz)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (

            (1 5 4 0)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 3 2 1)

        );
    }
    
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
 

);

// ************************************************************************* //
